<details>
<summary>Execution result of "run-all plan" in "aws"</summary>

```terraform
18:07:17.327 INFO   The stack at /github/workspace/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/vpc


18:07:17.723 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/aws/management/north-virginia/vpc/.terragrunt-cache/imz023Fez9MTqVLA3D1zXZstqKA/A35GeYiqYDYXDWZftKtd1kkU5ic
18:07:19.933 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
18:07:20.498 STDOUT [management/north-virginia/vpc] tofu: 
18:07:20.498 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
18:07:20.498 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
18:07:20.898 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
18:07:20.898 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
18:07:22.246 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.91.0...
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.91.0 (signed, key ID 0C0AF313E5FD9F80)
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
18:07:26.567 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu: OpenTofu used the selected providers to generate the following execution
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu: plan. Resource actions are indicated with the following symbols:
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:   + create
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu: OpenTofu will perform the following actions:
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:   # aws_default_network_acl.this[0] will be created
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_default_network_acl" "this" {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + arn                    = (known after apply)
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + default_network_acl_id = (known after apply)
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + tags                   = {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + tags_all               = {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + egress {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + action          = "allow"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + from_port       = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block = "::/0"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + protocol        = "-1"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + rule_no         = 101
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + to_port         = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + egress {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + action     = "allow"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block = "0.0.0.0/0"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + from_port  = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + protocol   = "-1"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + rule_no    = 100
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + to_port    = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + ingress {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + action          = "allow"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + from_port       = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block = "::/0"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + protocol        = "-1"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + rule_no         = 101
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + to_port         = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:       + ingress {
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + action     = "allow"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block = "0.0.0.0/0"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + from_port  = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + protocol   = "-1"
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + rule_no    = 100
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:           + to_port    = 0
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.739 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_default_route_table.default[0] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_default_route_table" "default" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + arn                    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + default_route_table_id = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + route                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags                   = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all               = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + update = "5m"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_default_security_group.this[0] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_default_security_group" "this" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + arn                    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + description            = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + egress                 = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ingress                = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + name                   = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + name_prefix            = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + revoke_rules_on_delete = false
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags                   = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all               = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_eip.nat[0] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + arn                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + association_id       = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + domain               = "vpc"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id                   = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + instance             = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags                 = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1a"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all             = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1a"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_eip.nat[1] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + arn                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + association_id       = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + domain               = "vpc"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id                   = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + instance             = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags                 = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1b"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all             = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1b"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_eip.nat[2] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + arn                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + association_id       = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + domain               = "vpc"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id                   = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + instance             = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags                 = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1c"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all             = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1c"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_internet_gateway.this[0] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_internet_gateway" "this" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + arn      = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id       = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + owner_id = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags     = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id   = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   # aws_nat_gateway.this[0] will be created
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + id                                 = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags                               = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1a"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                           = {
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1a"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.740 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:   # aws_nat_gateway.this[1] will be created
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + id                                 = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + tags                               = {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1b"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                           = {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1b"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:   # aws_nat_gateway.this[2] will be created
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + id                                 = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + tags                               = {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-west-1c"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                           = {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-west-1c"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[0] will be created
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
18:07:30.741 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[1] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[2] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route.public_internet_gateway[0] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route" "public_internet_gateway" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + gateway_id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id                     = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + origin                 = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + state                  = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + timeouts {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + create = "5m"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.private[0] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1a"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1a"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.private[1] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1b"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1b"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.private[2] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1c"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1c"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table.public[0] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table" "public" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + arn              = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id               = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags             = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags_all         = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.private[0] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.private[1] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.private[2] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.public[0] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.public[1] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_route_table_association.public[2] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.private[0] will be created
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1a"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.1.0/24"
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
18:07:30.742 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1a"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1a"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.private[1] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1b"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.2.0/24"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1b"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1b"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.private[2] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1c"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.3.0/24"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-west-1c"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-west-1c"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.public[0] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1a"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.101.0/24"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-west-1a"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-west-1a"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.public[1] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1b"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.102.0/24"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-west-1b"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-west-1b"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_subnet.public[2] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone                              = "eu-west-1c"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.103.0/24"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns64                                   = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id                                             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_native                                    = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags                                           = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-west-1c"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                                       = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-west-1c"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_vpc.this[0] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_vpc" "this" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn                                  = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + cidr_block                           = "10.0.0.0/16"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + default_network_acl_id               = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + default_route_table_id               = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + default_security_group_id            = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + dhcp_options_id                      = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns_hostnames                 = true
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_dns_support                   = true
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + enable_network_address_usage_metrics = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id                                   = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + instance_tenancy                     = "default"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_association_id                  = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block                      = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + ipv6_cidr_block_network_border_group = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + main_route_table_id                  = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + owner_id                             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags                                 = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all                             = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   # aws_vpn_gateway.this[0] will be created
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + resource "aws_vpn_gateway" "this" {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + amazon_side_asn = "64512"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + arn             = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + id              = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags            = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + tags_all        = {
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "environment" = "dev"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "platform"    = "aws"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "project"     = "iac"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:           + "team"        = "devops"
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:         }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + vpc_id          = (known after apply)
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     }
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu: Plan: 32 to add, 0 to change, 0 to destroy.
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu: 
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu: Changes to Outputs:
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + azs                                         = [
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1a",
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1b",
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1c",
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + cgw_arns                                    = []
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + cgw_ids                                     = []
18:07:30.743 STDOUT [management/north-virginia/vpc] tofu:   + database_nat_gateway_route_ids              = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_association_ids        = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_ids                    = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_arns                        = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_objects                     = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets                            = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_cidr_blocks                = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_ipv6_cidr_blocks           = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + default_network_acl_id                      = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + default_route_table_id                      = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + default_security_group_id                   = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_association_ids     = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_ids                 = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_arns                     = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_objects                  = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets                         = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_cidr_blocks             = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_ipv6_cidr_blocks        = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + igw_arn                                     = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + igw_id                                      = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_association_ids           = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_ids                       = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_arns                           = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_objects                        = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets                               = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_cidr_blocks                   = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_ipv6_cidr_blocks              = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + name                                        = "my-vpc"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + nat_ids                                     = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + nat_public_ips                              = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + natgw_ids                                   = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + natgw_interface_ids                         = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_arns                         = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_objects                      = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets                             = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_cidr_blocks                 = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_ipv6_cidr_blocks            = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_ipv6_egress_route_ids               = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_nat_gateway_route_ids               = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_association_ids         = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_ids                     = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_arns                         = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_objects                      = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1a"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.1.0/24"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-west-1a"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-west-1a"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:         },
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1b"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.2.0/24"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-west-1b"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-west-1b"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:         },
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1c"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.3.0/24"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-west-1c"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-west-1c"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:         },
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets                             = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_cidr_blocks                 = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.1.0/24",
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.2.0/24",
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.3.0/24",
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_ipv6_cidr_blocks            = []
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + public_internet_gateway_route_id            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_association_ids          = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_ids                      = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_arns                          = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_objects                       = [
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:       + {
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1a"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.101.0/24"
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.744 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-west-1a"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-west-1a"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:         },
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1b"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.102.0/24"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-west-1b"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-west-1b"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:         },
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone                              = "eu-west-1c"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.103.0/24"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_dns64                                   = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + id                                             = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + ipv6_native                                    = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + outpost_arn                                    = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + tags                                           = {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-west-1c"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + tags_all                                       = {
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-west-1c"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + environment = "dev"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + platform    = "aws"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + project     = "iac"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:               + team        = "devops"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:             }
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + timeouts                                       = null
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:         },
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets                              = [
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_cidr_blocks                  = [
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.101.0/24",
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.102.0/24",
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + "10.0.103.0/24",
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_ipv6_cidr_blocks             = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_public_route_table_association_ids = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_association_ids        = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_ids                    = [
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:       + (known after apply),
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:     ]
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_arns                        = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_objects                     = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets                            = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_cidr_blocks                = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_ipv6_cidr_blocks           = []
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + this_customer_gateway                       = {}
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vgw_arn                                     = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vgw_id                                      = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_arn                                     = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_block_public_access_exclusions          = {}
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_cidr_block                              = "10.0.0.0/16"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_enable_dns_hostnames                    = true
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_enable_dns_support                      = true
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_arn                = ""
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_id                                      = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_instance_tenancy                        = "default"
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_ipv6_association_id                     = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_ipv6_cidr_block                         = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_main_route_table_id                     = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_owner_id                                = (known after apply)
18:07:30.745 STDOUT [management/north-virginia/vpc] tofu:   + vpc_secondary_cidr_blocks                   = []
```

</details>
    
